#include <iostream>

void menu() {
    std::cout << "\nМеню:\n";
    std::cout << "1. Создать точку\n";
    std::cout << "2. Создать комплексное число\n";
    std::cout << "3. Вывести все точки\n";
    std::cout << "4. Вывести все комплексные числа\n";
    std::cout << "5. Сложить две точки\n";
    std::cout << "6. Сложить два комплексных числа\n";
    std::cout << "7. Переставить местами две точки\n";
    std::cout << "8. Переставить местами два комплексных числа\n";
    std::cout << "9. Выйти\n";
    std::cout << "Выберите пункт: ";
}
