#include <stdio.h>

#include "tablets.h"

void print_do(){
    printf("\n\n");
    printf(" ____________________________________________ \n");
    printf("| Выберите действие                          |\n");
    printf("| (a) Ввод таблицы                           |\n");
    printf("| (b) Ввод  |  удвление элемента             |\n");
    printf("| (c) Вывод значений                         |\n");
    printf("| Выход из программы Ctrl + D                |\n");
    printf("|____________________________________________|\n");
}
void print_import(){
    printf("\n\n");
    printf(" ____________________________________________ \n");
    printf("| Выберите действие                          |\n");
    printf("| (a) Ввод из потока ввода                   |\n");
    printf("| (b) Ввод из файла                          |\n");
    printf("| Выход из программы Ctrl + D                |\n");
    printf("|____________________________________________|\n");
}
void print_output(){
    printf("\n\n");
    printf(" ____________________________________________ \n");
    printf("| Выберите действие                          |\n");
    printf("| (a) Вывод в файл                           |\n");
    printf("| (b) Вывод таблицы                          |\n");
    printf("| (c) Вывод группы элементов                 |\n");
    printf("| Выход из программы Ctrl + D                |\n");
    printf("|____________________________________________|\n");
}
void print_out_1(){
    printf("\n\n");
    printf(" ____________________________________________ \n");
    printf("| Выберите действие                          |\n");
    printf("| (a) Вывод 1 элемента                       |\n");
    printf("| (b) Ввод 1 элемента                        |\n");
    printf("| (c) Удалить 1 элемент                      |\n");
    printf("| Выход из программы Ctrl + D                |\n");
    printf("|____________________________________________|\n");
}